Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_rsrc.c
/*
 * CDDL HEADER START
 *
 * The contents of this file are subject to the terms of the
 * Common Development and Distribution License (the "License").
 * You may not use this file except in compliance with the License.
 *
 * You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
 * or http://www.opensolaris.org/os/licensing.
 * See the License for the specific language governing permissions
 * and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL HEADER in each
 * file and include the License file at usr/src/OPENSOLARIS.LICENSE.
 * If applicable, add the following below this CDDL HEADER, with the
 * fields enclosed by brackets "[]" replaced with your own identifying
 * information: Portions Copyright [yyyy] [name of copyright owner]
 *
 * CDDL HEADER END
 */

/*
 * Copyright (c) 2010, 2011, Oracle and/or its affiliates. All rights reserved.
 */

/*
 * mcxnex_rsrc.c
 *    Mcxnex Resource Management Routines
 *
 *    Implements all the routines necessary for setup, teardown, and
 *    alloc/free of all Mcxnex resources, including those that are managed
 *    by Mcxnex hardware or which live in Mcxnex's direct attached DDR memory.
 */

#include <sys/types.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>
#include <sys/modctl.h>
#include <sys/vmem.h>
#include <sys/bitmap.h>
#include <sys/sdt.h>

#include "mcxnex.h"

/*
 * The following routines are used for initializing and destroying
 * the resource pools used by the Mcxnex resource allocation routines.
 * They consist of four classes of object:
 *
 * Mailboxes:  The "In" and "Out" mailbox types are used by the Mcxnex
 *    command interface routines.  Mailboxes are used to pass information
 *    back and forth to the Mcxnex firmware.  Either type of mailbox may
 *    be allocated from Mcxnex's direct attached DDR memory or from system
 *    memory (although currently all "In" mailboxes are in DDR and all "out"
 *    mailboxes come from system memory.
 *
 * HW entry objects:  These objects represent resources required by the Mcxnex
 *    hardware.  These objects include things like Queue Pair contexts (QPC),
 *    Completion Queue contexts (CQC), Event Queue contexts (EQC), RDB (for
 *    supporting RDMA Read/Atomic), Multicast Group entries (MCG), Memory
 *    Protection Table entries (MPT), Memory Translation Table entries (MTT).
 *
 *    What these objects all have in common is that they are each required
 *    to come from ICM memory, they are always allocated from tables, and
 *    they are not to be directly accessed (read or written) by driver
 *    software (Mellanox FMR access to MPT is an exception).
 *    The other notable exceptions are the UAR pages (UAR_PG) which are
 *    allocated from the UAR address space rather than DDR, and the UD
 *    address vectors (UDAV) which are similar to the common object types
 *    with the major difference being that UDAVs _are_ directly read and
 *    written by driver software.
 *
 * SW handle objects: These objects represent resources required by Mcxnex
 *    driver software.  They are primarily software tracking structures,
 *    which are allocated from system memory (using kmem_cache).  Several of
 *    the objects have both a "constructor" and "destructor" method
 *    associated with them (see below).
 *
 * Protection Domain (PD) handle objects:  These objects are very much like
 *    a SW handle object with the notable difference that all PD handle
 *    objects have an actual Protection Domain number (PD) associated with
 *    them (and the PD number is allocated/managed through a separate
 *    vmem_arena specifically set aside for this purpose.
 */

static int mcxnex_rsrc_mbox_init(mcxnex_state_t *state,
    mcxnex_rsrc_mbox_info_t *info);
static void mcxnex_rsrc_mbox_fini(mcxnex_state_t *state,
    mcxnex_rsrc_mbox_info_t *info);

static int mcxnex_rsrc_sw_handles_init(mcxnex_state_t *state,
    mcxnex_rsrc_sw_hdl_info_t *info);
static void mcxnex_rsrc_sw_handles_fini(mcxnex_state_t *state,
    mcxnex_rsrc_sw_hdl_info_t *info);

static int mcxnex_rsrc_pd_handles_init(mcxnex_state_t *state,
    mcxnex_rsrc_sw_hdl_info_t *info);
static void mcxnex_rsrc_pd_handles_fini(mcxnex_state_t *state,
    mcxnex_rsrc_sw_hdl_info_t *info);

/*
 * The following routines are used for allocating and freeing the specific
 * types of objects described above from their associated resource pools.
 */
static int mcxnex_rsrc_mbox_alloc(mcxnex_rsrc_pool_info_t *pool_info,
    uint_t num, mcxnex_rsrc_t *hdl);
static void mcxnex_rsrc_mbox_free(mcxnex_rsrc_pool_info_t *pool_info,
    mcxnex_rsrc_t *hdl);

static int mcxnex_rsrc_hw_entry_alloc(mcxnex_rsrc_pool_info_t *pool_info,
    uint_t num, uint_t num_align, ddi_acc_handle_t acc_handle,
    uint_t sleepflag, mcxnex_rsrc_t *hdl);
static void mcxnex_rsrc_hw_entry_free(mcxnex_rsrc_pool_info_t *pool_info,
    mcxnex_rsrc_t *hdl);

static int mcxnex_rsrc_hw_entry_icm_confirm(mcxnex_rsrc_pool_info_t *pool_info,
    uint_t num, mcxnex_rsrc_t *hdl);
static int mcxnex_rsrc_hw_entry_icm_free(mcxnex_rsrc_pool_info_t *pool_info,
    mcxnex_rsrc_t *hdl);

static int mcxnex_rsrc_swhdl_alloc(mcxnex_rsrc_pool_info_t *pool_info,
    uint_t sleepflag, mcxnex_rsrc_t *hdl);
static void mcxnex_rsrc_swhdl_free(mcxnex_rsrc_pool_info_t *pool_info,
    mcxnex_rsrc_t *hdl);

static int mcxnex_rsrc_pdhdl_alloc(mcxnex_rsrc_pool_info_t *pool_info,
    uint_t sleepflag, mcxnex_rsrc_t *hdl);
static void mcxnex_rsrc_pdhdl_free(mcxnex_rsrc_pool_info_t *pool_info,
    mcxnex_rsrc_t *hdl);

/*
 * The following routines are the constructors and destructors for several
 * of the SW handle type objects.  For certain types of SW handles objects
 * (all of which are implemented using kmem_cache), we need to do some
 * special field initialization (specifically, mutex_init/destroy).  These
 * routines enable that init and teardown.
 */
static int mcxnex_rsrc_pdhdl_constructor(void *pd, void *priv, int flags);
static void mcxnex_rsrc_pdhdl_destructor(void *pd, void *state);
static int mcxnex_rsrc_cqhdl_constructor(void *cq, void *priv, int flags);
static void mcxnex_rsrc_cqhdl_destructor(void *cq, void *state);
static int mcxnex_rsrc_qphdl_constructor(void *cq, void *priv, int flags);
static void mcxnex_rsrc_qphdl_destructor(void *cq, void *state);
static int mcxnex_rsrc_srqhdl_constructor(void *srq, void *priv, int flags);
static void mcxnex_rsrc_srqhdl_destructor(void *srq, void *state);
static int mcxnex_rsrc_refcnt_constructor(void *rc, void *priv, int flags);
static void mcxnex_rsrc_refcnt_destructor(void *rc, void *state);
static int mcxnex_rsrc_ahhdl_constructor(void *ah, void *priv, int flags);
static void mcxnex_rsrc_ahhdl_destructor(void *ah, void *state);
static int mcxnex_rsrc_mrhdl_constructor(void *mr, void *priv, int flags);
static void mcxnex_rsrc_mrhdl_destructor(void *mr, void *state);

