Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_rsrc.c
/*
 * Special routine to calculate and return the size of a MCG object based
 * on current driver configuration (specifically, the number of QP per MCG
 * that has been configured.
 */
static int mcxnex_rsrc_mcg_entry_get_size(mcxnex_state_t *state,
    uint_t *mcg_size_shift);


/*
 * mcxnex_rsrc_alloc()
 *
 *    Context: Can be called from interrupt or base context.
 *    The "sleepflag" parameter is used by all object allocators to
 *    determine whether to SLEEP for resources or not.
 */
int
mcxnex_rsrc_alloc(mcxnex_state_t *state, mcxnex_rsrc_type_t rsrc, uint_t num,
    uint_t sleepflag, mcxnex_rsrc_t **hdl)
{
	mcxnex_rsrc_pool_info_t	*rsrc_pool;
	mcxnex_rsrc_t		*tmp_rsrc_hdl;
	int			flag, status = DDI_FAILURE;

	ASSERT(state != NULL);
	ASSERT(hdl != NULL);

	rsrc_pool = &state->hs_rsrc_hdl[rsrc];
	ASSERT(rsrc_pool != NULL);

	/*
	 * Allocate space for the object used to track the resource handle
	 */
	flag = (sleepflag == DDI_SLEEP) ? KM_SLEEP : KM_NOSLEEP;
	tmp_rsrc_hdl = (mcxnex_rsrc_t *)kmem_cache_alloc(state->hs_rsrc_cache,
	    flag);
	if (tmp_rsrc_hdl == NULL) {
		return (DDI_FAILURE);
	}
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*tmp_rsrc_hdl))

	/*
	 * Set rsrc_hdl type.  This is later used by the mcxnex_rsrc_free call
	 * to know what type of resource is being freed.
	 */
	tmp_rsrc_hdl->rsrc_type = rsrc;

	/*
	 * Depending on resource type, call the appropriate alloc routine
	 */
	switch (rsrc_pool->rsrc_type) {
	case MCXNEX_IN_MBOX:
	case MCXNEX_OUT_MBOX:
	case MCXNEX_INTR_IN_MBOX:
	case MCXNEX_INTR_OUT_MBOX:
		status = mcxnex_rsrc_mbox_alloc(rsrc_pool, num, tmp_rsrc_hdl);
		break;

	case MCXNEX_QPC:
	case MCXNEX_CQC:
	case MCXNEX_SRQC:
	case MCXNEX_EQC:
		/*
		 * Because these objects are NOT accessed by Mcxnex driver
		 * software, we set the acc_handle parameter to zero.
		 */
		status = mcxnex_rsrc_hw_entry_alloc(rsrc_pool, num, 1, 0,
		    sleepflag, tmp_rsrc_hdl);
		break;

	case MCXNEX_DMPT:
		/*
		 * Because these objects are sometimes accessed by Mcxnex
		 * driver software (FMR for MPTs), we need the acc_handle
		 * to be set.  The ICM-aware code will set it for all
		 * ICM backed resources.
		 * But if they are allocated in multiples, we specify here that
		 * they must be aligned on a more restrictive boundary.
		 */
		status = mcxnex_rsrc_hw_entry_alloc(rsrc_pool, num, num,
		    0, sleepflag, tmp_rsrc_hdl);
		break;

	case MCXNEX_MCG:
		/*
		 * Mcxnex MCG entries are also NOT accessed by Mcxnex driver
		 * software, but because MCG entries do not have the same
		 * alignnment restrictions we loosen the constraint here.
		 */
		status = mcxnex_rsrc_hw_entry_alloc(rsrc_pool, num, 1, 0,
		    sleepflag, tmp_rsrc_hdl);
		break;

	case MCXNEX_MTT:
		/*
		 * Because MTT objects are among the few HW resources that
		 * may be allocated in odd numbers, we specify a less
		 * restrictive alignment than for the above resources.
		 */
		status = mcxnex_rsrc_hw_entry_alloc(rsrc_pool, num, 1,
		    0, sleepflag, tmp_rsrc_hdl);
		break;

	case MCXNEX_UARPG:
		/*
		 * Because UAR pages are written by Mcxnex driver software (for
		 * doorbells), we set the acc_handle parameter to point to
		 * the ddi_acc_handle_t for the Mcxnex UAR memory.
		 */
		status = mcxnex_rsrc_hw_entry_alloc(rsrc_pool, num, 1,
		    mcxnex_rsrc_alloc_uarhdl(state), sleepflag, tmp_rsrc_hdl);
		break;

	case MCXNEX_MRHDL:
	case MCXNEX_EQHDL:
	case MCXNEX_CQHDL:
	case MCXNEX_SRQHDL:
	case MCXNEX_AHHDL:
	case MCXNEX_QPHDL:
	case MCXNEX_REFCNT:
		status = mcxnex_rsrc_swhdl_alloc(rsrc_pool, sleepflag,
		    tmp_rsrc_hdl);
		break;

	case MCXNEX_PDHDL:
		status = mcxnex_rsrc_pdhdl_alloc(rsrc_pool, sleepflag,
		    tmp_rsrc_hdl);
		break;

	case MCXNEX_RDB:	/* handled during MCXNEX_QPC */
	case MCXNEX_ALTC:	/* handled during MCXNEX_QPC */
	case MCXNEX_AUXC:	/* handled during MCXNEX_QPC */
	case MCXNEX_CMPT_QPC:	/* handled during MCXNEX_QPC */
	case MCXNEX_CMPT_SRQC:	/* handled during MCXNEX_SRQC */
	case MCXNEX_CMPT_CQC:	/* handled during MCXNEX_CPC */
	case MCXNEX_CMPT_EQC:	/* handled during MCXNEX_EPC */
	default:
		MCXNEX_WARNING(state, "unexpected resource type in alloc ");
		cmn_err(CE_WARN, "Resource type %x \n", rsrc_pool->rsrc_type);
		break;
	}

	/*
	 * If the resource allocation failed, then free the special resource
	 * tracking structure and return failure.  Otherwise return the
	 * handle for the resource tracking structure.
	 */
	if (status != DDI_SUCCESS) {
		kmem_cache_free(state->hs_rsrc_cache, tmp_rsrc_hdl);
		tmp_rsrc_hdl = NULL;
		return (DDI_FAILURE);
	} else {
		*hdl = tmp_rsrc_hdl;
		return (DDI_SUCCESS);
	}
}


/*
 * mcxnex_rsrc_free()
 *    Context: Can be called from interrupt or base context.
 */
void
mcxnex_rsrc_free(mcxnex_state_t *state, mcxnex_rsrc_t **hdl)
{
	mcxnex_rsrc_pool_info_t	*rsrc_pool;

	ASSERT(state != NULL);
	ASSERT(hdl != NULL);

	rsrc_pool = &state->hs_rsrc_hdl[(*hdl)->rsrc_type];
	ASSERT(rsrc_pool != NULL);

	/*
	 * Depending on resource type, call the appropriate free routine
	 */
	switch (rsrc_pool->rsrc_type) {
	case MCXNEX_IN_MBOX:
	case MCXNEX_OUT_MBOX:
	case MCXNEX_INTR_IN_MBOX:
	case MCXNEX_INTR_OUT_MBOX:
		mcxnex_rsrc_mbox_free(rsrc_pool, *hdl);
		break;

	case MCXNEX_QPC:
	case MCXNEX_CQC:
	case MCXNEX_SRQC:
	case MCXNEX_EQC:
	case MCXNEX_DMPT:
	case MCXNEX_MCG:
	case MCXNEX_MTT:
	case MCXNEX_UARPG:
		mcxnex_rsrc_hw_entry_free(rsrc_pool, *hdl);
		break;

	case MCXNEX_MRHDL:
	case MCXNEX_EQHDL:
	case MCXNEX_CQHDL:
	case MCXNEX_SRQHDL:
	case MCXNEX_AHHDL:
	case MCXNEX_QPHDL:
	case MCXNEX_REFCNT:
		mcxnex_rsrc_swhdl_free(rsrc_pool, *hdl);
		break;

	case MCXNEX_PDHDL:
		mcxnex_rsrc_pdhdl_free(rsrc_pool, *hdl);
		break;

	case MCXNEX_RDB:
	case MCXNEX_ALTC:
	case MCXNEX_AUXC:
	case MCXNEX_CMPT_QPC:
	case MCXNEX_CMPT_SRQC:
	case MCXNEX_CMPT_CQC:
	case MCXNEX_CMPT_EQC:
	default:
		MCXNEX_WARNING(state, "unexpected resource type in free");
		break;
	}

	/*
	 * Free the special resource tracking structure, set the handle to
	 * NULL, and return.
	 */
	kmem_cache_free(state->hs_rsrc_cache, *hdl);
	*hdl = NULL;
}


