Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_rsrc.c
/*
 * mcxnex_rsrc_init_phase1()
 *
 *    Completes the first phase of Mcxnex resource/configuration init.
 *    This involves creating the kmem_cache for the "mcxnex_rsrc_t"
 *    structs, allocating the space for the resource pool handles,
 *    and setting up the "Out" mailboxes.
 *
 *    When this function completes, the Mcxnex driver is ready to
 *    post the following commands which return information only in the
 *    "Out" mailbox: QUERY_DDR, QUERY_FW, QUERY_DEV_LIM, and QUERY_ADAPTER
 *    If any of these commands are to be posted at this time, they must be
 *    done so only when "spinning" (as the outstanding command list and
 *    EQ setup code has not yet run)
 *
 *    Context: Only called from attach() path context
 */
int
mcxnex_rsrc_init_phase1(mcxnex_state_t *state)
{
	mcxnex_rsrc_pool_info_t		*rsrc_pool;
	mcxnex_rsrc_mbox_info_t 		mbox_info;
	mcxnex_rsrc_cleanup_level_t	cleanup;
	mcxnex_cfg_profile_t		*cfgprof;
	uint64_t			num, size;
	int				status;
	char				*rsrc_name;

	ASSERT(state != NULL);

	/* This is where Phase 1 of resource initialization begins */
	cleanup = MCXNEX_RSRC_CLEANUP_LEVEL0;

	/* Build kmem cache name from Mcxnex instance */
	rsrc_name = (char *)kmem_zalloc(MCXNEX_RSRC_NAME_MAXLEN, KM_SLEEP);
	MCXNEX_RSRC_NAME(rsrc_name, MCXNEX_RSRC_CACHE);

	/*
	 * Create the kmem_cache for "mcxnex_rsrc_t" structures
	 * (kmem_cache_create will SLEEP until successful)
	 */
	state->hs_rsrc_cache = kmem_cache_create(rsrc_name,
	    sizeof (mcxnex_rsrc_t), 0, NULL, NULL, NULL, NULL, NULL, 0);

	/*
	 * Allocate an array of mcxnex_rsrc_pool_info_t's (used in all
	 * subsequent resource allocations)
	 */
	state->hs_rsrc_hdl = kmem_zalloc(MCXNEX_NUM_RESOURCES *
	    sizeof (mcxnex_rsrc_pool_info_t), KM_SLEEP);

	/* Pull in the configuration profile */
	cfgprof = state->hs_cfg_profile;

	/* Initialize the resource pool for "out" mailboxes */
	num  =  ((uint64_t)1 << cfgprof->cp_log_num_outmbox);
	size =  ((uint64_t)1 << cfgprof->cp_log_outmbox_size);
	rsrc_pool = &state->hs_rsrc_hdl[MCXNEX_OUT_MBOX];
	rsrc_pool->rsrc_type	  = MCXNEX_OUT_MBOX;
	rsrc_pool->rsrc_loc	  = MCXNEX_IN_SYSMEM;
	rsrc_pool->rsrc_pool_size = (size * num);
	rsrc_pool->rsrc_shift	  = cfgprof->cp_log_outmbox_size;
	rsrc_pool->rsrc_quantum	  = (uint_t)size;
	rsrc_pool->rsrc_align	  = MCXNEX_MBOX_ALIGN;
	rsrc_pool->rsrc_state	  = state;
	mbox_info.mbi_num	  = num;
	mbox_info.mbi_size	  = size;
	mbox_info.mbi_rsrcpool	  = rsrc_pool;
	status = mcxnex_rsrc_mbox_init(state, &mbox_info);
	if (status != DDI_SUCCESS) {
		mcxnex_rsrc_fini(state, cleanup);
		status = DDI_FAILURE;
		goto rsrcinitp1_fail;
	}
	cleanup = MCXNEX_RSRC_CLEANUP_LEVEL1;

	/* Initialize the mailbox list */
	status = mcxnex_outmbox_list_init(state);
	if (status != DDI_SUCCESS) {
		mcxnex_rsrc_fini(state, cleanup);
		status = DDI_FAILURE;
		goto rsrcinitp1_fail;
	}
	cleanup = MCXNEX_RSRC_CLEANUP_LEVEL2;

	/* Initialize the resource pool for "interrupt out" mailboxes */
	num  =  ((uint64_t)1 << cfgprof->cp_log_num_intr_outmbox);
	size =  ((uint64_t)1 << cfgprof->cp_log_outmbox_size);
	rsrc_pool = &state->hs_rsrc_hdl[MCXNEX_INTR_OUT_MBOX];
	rsrc_pool->rsrc_type	  = MCXNEX_INTR_OUT_MBOX;
	rsrc_pool->rsrc_loc	  = MCXNEX_IN_SYSMEM;
	rsrc_pool->rsrc_pool_size = (size * num);
	rsrc_pool->rsrc_shift	  = cfgprof->cp_log_outmbox_size;
	rsrc_pool->rsrc_quantum	  = (uint_t)size;
	rsrc_pool->rsrc_align	  = MCXNEX_MBOX_ALIGN;
	rsrc_pool->rsrc_state	  = state;
	mbox_info.mbi_num	  = num;
	mbox_info.mbi_size	  = size;
	mbox_info.mbi_rsrcpool	  = rsrc_pool;
	status = mcxnex_rsrc_mbox_init(state, &mbox_info);
	if (status != DDI_SUCCESS) {
		mcxnex_rsrc_fini(state, cleanup);
		status = DDI_FAILURE;
		goto rsrcinitp1_fail;
	}
	cleanup = MCXNEX_RSRC_CLEANUP_LEVEL3;

	/* Initialize the mailbox list */
	status = mcxnex_intr_outmbox_list_init(state);
	if (status != DDI_SUCCESS) {
		mcxnex_rsrc_fini(state, cleanup);
		status = DDI_FAILURE;
		goto rsrcinitp1_fail;
	}
	cleanup = MCXNEX_RSRC_CLEANUP_LEVEL4;

	/* Initialize the resource pool for "in" mailboxes */
	num  =  ((uint64_t)1 << cfgprof->cp_log_num_inmbox);
	size =  ((uint64_t)1 << cfgprof->cp_log_inmbox_size);
	rsrc_pool = &state->hs_rsrc_hdl[MCXNEX_IN_MBOX];
	rsrc_pool->rsrc_type	  = MCXNEX_IN_MBOX;
	rsrc_pool->rsrc_loc	  = MCXNEX_IN_SYSMEM;
	rsrc_pool->rsrc_pool_size = (size * num);
	rsrc_pool->rsrc_shift	  = cfgprof->cp_log_inmbox_size;
	rsrc_pool->rsrc_quantum	  = (uint_t)size;
	rsrc_pool->rsrc_align	  = MCXNEX_MBOX_ALIGN;
	rsrc_pool->rsrc_state	  = state;
	mbox_info.mbi_num	  = num;
	mbox_info.mbi_size	  = size;
	mbox_info.mbi_rsrcpool	  = rsrc_pool;
	status = mcxnex_rsrc_mbox_init(state, &mbox_info);
	if (status != DDI_SUCCESS) {
		mcxnex_rsrc_fini(state, cleanup);
		status = DDI_FAILURE;
		goto rsrcinitp1_fail;
	}
	cleanup = MCXNEX_RSRC_CLEANUP_LEVEL5;

	/* Initialize the mailbox list */
	status = mcxnex_inmbox_list_init(state);
	if (status != DDI_SUCCESS) {
		mcxnex_rsrc_fini(state, cleanup);
		status = DDI_FAILURE;
		goto rsrcinitp1_fail;
	}
	cleanup = MCXNEX_RSRC_CLEANUP_LEVEL6;

	/* Initialize the resource pool for "interrupt in" mailboxes */
	num  =  ((uint64_t)1 << cfgprof->cp_log_num_intr_inmbox);
	size =  ((uint64_t)1 << cfgprof->cp_log_inmbox_size);
	rsrc_pool = &state->hs_rsrc_hdl[MCXNEX_INTR_IN_MBOX];
	rsrc_pool->rsrc_type	  = MCXNEX_INTR_IN_MBOX;
	rsrc_pool->rsrc_loc	  = MCXNEX_IN_SYSMEM;
	rsrc_pool->rsrc_pool_size = (size * num);
	rsrc_pool->rsrc_shift	  = cfgprof->cp_log_inmbox_size;
	rsrc_pool->rsrc_quantum	  = (uint_t)size;
	rsrc_pool->rsrc_align	  = MCXNEX_MBOX_ALIGN;
	rsrc_pool->rsrc_state	  = state;
	mbox_info.mbi_num	  = num;
	mbox_info.mbi_size	  = size;
	mbox_info.mbi_rsrcpool	  = rsrc_pool;
	status = mcxnex_rsrc_mbox_init(state, &mbox_info);
	if (status != DDI_SUCCESS) {
		mcxnex_rsrc_fini(state, cleanup);
		status = DDI_FAILURE;
		goto rsrcinitp1_fail;
	}
	cleanup = MCXNEX_RSRC_CLEANUP_LEVEL7;

	/* Initialize the mailbox list */
	status = mcxnex_intr_inmbox_list_init(state);
	if (status != DDI_SUCCESS) {
		mcxnex_rsrc_fini(state, cleanup);
		status = DDI_FAILURE;
		goto rsrcinitp1_fail;
	}
	cleanup = MCXNEX_RSRC_CLEANUP_PHASE1_COMPLETE;
	kmem_free(rsrc_name, MCXNEX_RSRC_NAME_MAXLEN);
	return (DDI_SUCCESS);

rsrcinitp1_fail:
	kmem_free(rsrc_name, MCXNEX_RSRC_NAME_MAXLEN);
	return (status);
}


