Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_rsrc.c
/*
 * mcxnex_rsrc_init_phase2()
 *    Context: Only called from attach() path context
 */
int
mcxnex_rsrc_init_phase2(mcxnex_state_t *state)
{
	mcxnex_rsrc_sw_hdl_info_t	hdl_info;
	mcxnex_rsrc_hw_entry_info_t	entry_info;
	mcxnex_rsrc_pool_info_t		*rsrc_pool;
	mcxnex_rsrc_cleanup_level_t	cleanup, ncleanup;
	mcxnex_cfg_profile_t		*cfgprof;
	mcxnex_hw_querydevlim_t		*devlim;
	uint64_t			num, max, num_prealloc;
	uint_t				mcg_size, mcg_size_shift;
	int				i, status;
	char				*rsrc_name;

	ASSERT(state != NULL);

	/* Phase 2 initialization begins where Phase 1 left off */
	cleanup = MCXNEX_RSRC_CLEANUP_PHASE1_COMPLETE;

	/* Allocate the ICM resource name space */

	/* Build the ICM vmem arena names from Mcxnex instance */
	rsrc_name = (char *)kmem_zalloc(MCXNEX_RSRC_NAME_MAXLEN, KM_SLEEP);

	/*
	 * Initialize the resource pools for all objects that exist in
	 * context memory (ICM). The ICM consists of context tables, each
	 * type of resource (QP, CQ, EQ, etc) having it's own context table
	 * (QPC, CQC, EQC, etc...).
	 */
	cfgprof = state->hs_cfg_profile;
	devlim	= &state->hs_devlim;

	/*
	 * Initialize the resource pools for each of the driver resources.
	 * With a few exceptions, these resources fall into the two cateogories
	 * of either hw_entries or sw_entries.
	 */

	/*
	 * Initialize the resource pools for ICM (hardware) types first.
	 * These resources are managed through vmem arenas, which are
	 * created via the rsrc pool initialization routine. Note that,
	 * due to further calculations, the MCG resource pool is
	 * initialized separately.
	 */
	for (i = 0; i < MCXNEX_NUM_ICM_RESOURCES; i++) {

		rsrc_pool = &state->hs_rsrc_hdl[i];
		rsrc_pool->rsrc_type = i;

		/* Set the resource-specific attributes */
		switch (i) {
		case MCXNEX_MTT:
			max = ((uint64_t)1 << devlim->log_max_mtt);
			num_prealloc = ((uint64_t)1 << devlim->log_rsvd_mtt);
			MCXNEX_RSRC_NAME(rsrc_name, MCXNEX_MTT_VMEM);
			ncleanup = MCXNEX_RSRC_CLEANUP_LEVEL9;
			break;

		case MCXNEX_DMPT:
			max = ((uint64_t)1 << devlim->log_max_dmpt);
			num_prealloc = ((uint64_t)1 << devlim->log_rsvd_dmpt);
			MCXNEX_RSRC_NAME(rsrc_name, MCXNEX_DMPT_VMEM);
			ncleanup = MCXNEX_RSRC_CLEANUP_LEVEL10;
			break;

		case MCXNEX_QPC:
			max = ((uint64_t)1 << devlim->log_max_qp);
			num_prealloc = ((uint64_t)1 << devlim->log_rsvd_qp);
			MCXNEX_RSRC_NAME(rsrc_name, MCXNEX_QPC_VMEM);
			ncleanup = MCXNEX_RSRC_CLEANUP_LEVEL11;
			break;

		case MCXNEX_CQC:
			max = ((uint64_t)1 << devlim->log_max_cq);
			num_prealloc = ((uint64_t)1 << devlim->log_rsvd_cq);
			MCXNEX_RSRC_NAME(rsrc_name, MCXNEX_CQC_VMEM);
			ncleanup = MCXNEX_RSRC_CLEANUP_LEVEL13;
			break;

		case MCXNEX_SRQC:
			max = ((uint64_t)1 << devlim->log_max_srq);
			num_prealloc = ((uint64_t)1 << devlim->log_rsvd_srq);
			MCXNEX_RSRC_NAME(rsrc_name, MCXNEX_SRQC_VMEM);
			ncleanup = MCXNEX_RSRC_CLEANUP_LEVEL16;
			break;

		case MCXNEX_EQC:
			max = ((uint64_t)1 << devlim->log_max_eq);
			num_prealloc = devlim->num_rsvd_eq;
			MCXNEX_RSRC_NAME(rsrc_name, MCXNEX_EQC_VMEM);
			ncleanup = MCXNEX_RSRC_CLEANUP_LEVEL18;
			break;

		case MCXNEX_MCG:	/* handled below */
		case MCXNEX_AUXC:
		case MCXNEX_ALTC:
		case MCXNEX_RDB:
		case MCXNEX_CMPT_QPC:
		case MCXNEX_CMPT_SRQC:
		case MCXNEX_CMPT_CQC:
		case MCXNEX_CMPT_EQC:
		default:
			/* We don't need to initialize this rsrc here. */
			continue;
		}

		/* Set the common values for all resource pools */
		rsrc_pool->rsrc_state	  = state;
		rsrc_pool->rsrc_loc	  = MCXNEX_IN_ICM;
		rsrc_pool->rsrc_pool_size = state->hs_icm[i].table_size;
		rsrc_pool->rsrc_align	  = state->hs_icm[i].table_size;
		rsrc_pool->rsrc_shift	  = state->hs_icm[i].log_object_size;
		rsrc_pool->rsrc_quantum	  = state->hs_icm[i].object_size;

		/* Now, initialize the entry_info and call the init routine */
		entry_info.hwi_num	  = state->hs_icm[i].num_entries;
		entry_info.hwi_max	  = max;
		entry_info.hwi_prealloc	  = num_prealloc;
		entry_info.hwi_rsrcpool	  = rsrc_pool;
		entry_info.hwi_rsrcname	  = rsrc_name;
		status = mcxnex_rsrc_hw_entries_init(state, &entry_info);
		if (status != DDI_SUCCESS) {
			mcxnex_rsrc_fini(state, cleanup);
			status = DDI_FAILURE;
			goto rsrcinitp2_fail;
		}
		cleanup = ncleanup;
	}

	/*
	 * Initialize the Multicast Group (MCG) entries. First, calculate
	 * (and validate) the size of the MCGs.
	 */
	status = mcxnex_rsrc_mcg_entry_get_size(state, &mcg_size_shift);
	if (status != DDI_SUCCESS) {
		mcxnex_rsrc_fini(state, cleanup);
		status = DDI_FAILURE;
		goto rsrcinitp2_fail;
	}
	mcg_size = MCXNEX_MCGMEM_SZ(state);

	/*
	 * Initialize the resource pool for the MCG table entries.  Notice
	 * that the number of MCGs is configurable. Note also that a certain
	 * number of MCGs must be set aside for Mcxnex firmware use (they
	 * correspond to the number of MCGs used by the internal hash
	 * function).
	 */
	num			  = ((uint64_t)1 << cfgprof->cp_log_num_mcg);
	max			  = ((uint64_t)1 << devlim->log_max_mcg);
	num_prealloc	  = ((uint64_t)1 << cfgprof->cp_log_num_mcg_hash);
	rsrc_pool		  = &state->hs_rsrc_hdl[MCXNEX_MCG];
	rsrc_pool->rsrc_type	  = MCXNEX_MCG;
	rsrc_pool->rsrc_loc	  = MCXNEX_IN_ICM;
	rsrc_pool->rsrc_pool_size = (mcg_size * num);
	rsrc_pool->rsrc_shift	  = mcg_size_shift;
	rsrc_pool->rsrc_quantum	  = mcg_size;
	rsrc_pool->rsrc_align	  = (mcg_size * num);
	rsrc_pool->rsrc_state	  = state;
	MCXNEX_RSRC_NAME(rsrc_name, MCXNEX_MCG_VMEM);
	entry_info.hwi_num	  = num;
	entry_info.hwi_max	  = max;
	entry_info.hwi_prealloc	  = num_prealloc;
	entry_info.hwi_rsrcpool	  = rsrc_pool;
	entry_info.hwi_rsrcname	  = rsrc_name;
	status = mcxnex_rsrc_hw_entries_init(state, &entry_info);
	if (status != DDI_SUCCESS) {
		mcxnex_rsrc_fini(state, cleanup);
		status = DDI_FAILURE;
		goto rsrcinitp2_fail;
	}
	cleanup = MCXNEX_RSRC_CLEANUP_LEVEL19;

	/*
	 * Initialize the full range of ICM for the AUXC resource.
	 * This is done because its size is so small, about 1 byte per QP.
	 */

	/*
	 * Initialize the Mcxnex command handling interfaces.  This step
	 * sets up the outstanding command tracking mechanism for easy access
	 * and fast allocation (see mcxnex_cmd.c for more details).
	 */
	status = mcxnex_outstanding_cmdlist_init(state);
	if (status != DDI_SUCCESS) {
		mcxnex_rsrc_fini(state, cleanup);
		status = DDI_FAILURE;
		goto rsrcinitp2_fail;
	}
	cleanup = MCXNEX_RSRC_CLEANUP_LEVEL20;

