Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_rsrc.c
	/* Initialize the resource pool and vmem arena for the PD handles */
	rsrc_pool		 = &state->hs_rsrc_hdl[MCXNEX_PDHDL];
	rsrc_pool->rsrc_type	 = MCXNEX_PDHDL;
	rsrc_pool->rsrc_loc	 = MCXNEX_IN_SYSMEM;
	rsrc_pool->rsrc_quantum	 = sizeof (struct mcxnex_sw_pd_s);
	rsrc_pool->rsrc_state	 = state;
	MCXNEX_RSRC_NAME(rsrc_name, MCXNEX_PDHDL_CACHE);
	hdl_info.swi_num	 = ((uint64_t)1 << cfgprof->cp_log_num_pd);
	hdl_info.swi_max	 = ((uint64_t)1 << devlim->log_max_pd);
	hdl_info.swi_rsrcpool	 = rsrc_pool;
	hdl_info.swi_constructor = mcxnex_rsrc_pdhdl_constructor;
	hdl_info.swi_destructor	 = mcxnex_rsrc_pdhdl_destructor;
	hdl_info.swi_rsrcname	 = rsrc_name;
	hdl_info.swi_flags	 = MCXNEX_SWHDL_KMEMCACHE_INIT;
	status = mcxnex_rsrc_pd_handles_init(state, &hdl_info);
	if (status != DDI_SUCCESS) {
		mcxnex_rsrc_fini(state, cleanup);
		status = DDI_FAILURE;
		goto rsrcinitp2_fail;
	}
	cleanup = MCXNEX_RSRC_CLEANUP_LEVEL21;

	/*
	 * Initialize the resource pools for the rest of the software handles.
	 * This includes MR handles, EQ handles, QP handles, etc.  These
	 * objects are almost entirely managed using kmem_cache routines,
	 * and do not utilize a vmem arena.
	 */
	for (i = MCXNEX_NUM_ICM_RESOURCES; i < MCXNEX_NUM_RESOURCES; i++) {
		rsrc_pool = &state->hs_rsrc_hdl[i];

		/* Set the resource-specific attributes */
		switch (i) {
		case MCXNEX_MRHDL:
			rsrc_pool->rsrc_type    = MCXNEX_MRHDL;
			rsrc_pool->rsrc_quantum =
			    sizeof (struct mcxnex_sw_mr_s);
			MCXNEX_RSRC_NAME(rsrc_name, MCXNEX_MRHDL_CACHE);
			hdl_info.swi_num =
			    ((uint64_t)1 << cfgprof->cp_log_num_dmpt) +
			    ((uint64_t)1 << cfgprof->cp_log_num_cmpt);
			hdl_info.swi_max =
			    ((uint64_t)1 << cfgprof->cp_log_num_dmpt) +
			    ((uint64_t)1 << cfgprof->cp_log_num_cmpt);
			hdl_info.swi_constructor =
			    mcxnex_rsrc_mrhdl_constructor;
			hdl_info.swi_destructor	 = mcxnex_rsrc_mrhdl_destructor;
			hdl_info.swi_flags	 = MCXNEX_SWHDL_KMEMCACHE_INIT;
			ncleanup = MCXNEX_RSRC_CLEANUP_LEVEL22;
			break;

		case MCXNEX_EQHDL:
			rsrc_pool->rsrc_type    = MCXNEX_EQHDL;
			rsrc_pool->rsrc_quantum =
			    sizeof (struct mcxnex_sw_eq_s);
			MCXNEX_RSRC_NAME(rsrc_name, MCXNEX_EQHDL_CACHE);
			hdl_info.swi_num = MCXNEX_NUM_EQ;
			hdl_info.swi_max = ((uint64_t)1 << devlim->log_max_eq);
			hdl_info.swi_constructor = NULL;
			hdl_info.swi_destructor	 = NULL;
			hdl_info.swi_flags	 = MCXNEX_SWHDL_KMEMCACHE_INIT;
			ncleanup = MCXNEX_RSRC_CLEANUP_LEVEL23;
			break;

		case MCXNEX_CQHDL:
			rsrc_pool->rsrc_type    = MCXNEX_CQHDL;
			rsrc_pool->rsrc_quantum =
			    sizeof (struct mcxnex_sw_cq_s);
			MCXNEX_RSRC_NAME(rsrc_name, MCXNEX_CQHDL_CACHE);
			hdl_info.swi_num =
			    (uint64_t)1 << cfgprof->cp_log_num_cq;
			hdl_info.swi_max = (uint64_t)1 << devlim->log_max_cq;
			hdl_info.swi_constructor =
			    mcxnex_rsrc_cqhdl_constructor;
			hdl_info.swi_destructor	 = mcxnex_rsrc_cqhdl_destructor;
			hdl_info.swi_flags = (MCXNEX_SWHDL_KMEMCACHE_INIT |
			    MCXNEX_SWHDL_TABLE_INIT);
			hdl_info.swi_prealloc_sz = sizeof (mcxnex_cqhdl_t);
			ncleanup = MCXNEX_RSRC_CLEANUP_LEVEL24;
			break;

		case MCXNEX_SRQHDL:
			rsrc_pool->rsrc_type    = MCXNEX_SRQHDL;
			rsrc_pool->rsrc_quantum =
			    sizeof (struct mcxnex_sw_srq_s);
			MCXNEX_RSRC_NAME(rsrc_name, MCXNEX_SRQHDL_CACHE);
			hdl_info.swi_num =
			    (uint64_t)1 << cfgprof->cp_log_num_srq;
			hdl_info.swi_max = (uint64_t)1 << devlim->log_max_srq;
			hdl_info.swi_constructor =
			    mcxnex_rsrc_srqhdl_constructor;
			hdl_info.swi_destructor = mcxnex_rsrc_srqhdl_destructor;
			hdl_info.swi_flags = (MCXNEX_SWHDL_KMEMCACHE_INIT |
			    MCXNEX_SWHDL_TABLE_INIT);
			hdl_info.swi_prealloc_sz = sizeof (mcxnex_srqhdl_t);
			ncleanup = MCXNEX_RSRC_CLEANUP_LEVEL25;
			break;

		case MCXNEX_AHHDL:
			rsrc_pool->rsrc_type	= MCXNEX_AHHDL;
			rsrc_pool->rsrc_quantum	=
			    sizeof (struct mcxnex_sw_ah_s);
			MCXNEX_RSRC_NAME(rsrc_name, MCXNEX_AHHDL_CACHE);
			hdl_info.swi_num =
			    (uint64_t)1 << cfgprof->cp_log_num_ah;
			hdl_info.swi_max = MCXNEX_NUM_AH;
			hdl_info.swi_constructor =
			    mcxnex_rsrc_ahhdl_constructor;
			hdl_info.swi_destructor	 = mcxnex_rsrc_ahhdl_destructor;
			hdl_info.swi_flags	 = MCXNEX_SWHDL_KMEMCACHE_INIT;
			ncleanup = MCXNEX_RSRC_CLEANUP_LEVEL26;
			break;

		case MCXNEX_QPHDL:
			rsrc_pool->rsrc_type    = MCXNEX_QPHDL;
			rsrc_pool->rsrc_quantum =
			    sizeof (struct mcxnex_sw_qp_s);
			MCXNEX_RSRC_NAME(rsrc_name, MCXNEX_QPHDL_CACHE);
			hdl_info.swi_num =
			    (uint64_t)1 << cfgprof->cp_log_num_qp;
			hdl_info.swi_max = (uint64_t)1 << devlim->log_max_qp;
			hdl_info.swi_constructor =
			    mcxnex_rsrc_qphdl_constructor;
			hdl_info.swi_destructor	= mcxnex_rsrc_qphdl_destructor;
			hdl_info.swi_flags = (MCXNEX_SWHDL_KMEMCACHE_INIT |
			    MCXNEX_SWHDL_TABLE_INIT);
			hdl_info.swi_prealloc_sz = sizeof (mcxnex_qphdl_t);
			ncleanup = MCXNEX_RSRC_CLEANUP_LEVEL27;
			break;

		case MCXNEX_REFCNT:
			rsrc_pool->rsrc_type	 = MCXNEX_REFCNT;
			rsrc_pool->rsrc_quantum	 = sizeof (mcxnex_sw_refcnt_t);
			MCXNEX_RSRC_NAME(rsrc_name, MCXNEX_REFCNT_CACHE);
			hdl_info.swi_num =
			    (uint64_t)1 << cfgprof->cp_log_num_dmpt;
			hdl_info.swi_max = (uint64_t)1 << devlim->log_max_dmpt;
			hdl_info.swi_constructor =
			    mcxnex_rsrc_refcnt_constructor;
			hdl_info.swi_destructor = mcxnex_rsrc_refcnt_destructor;
			hdl_info.swi_flags	 = MCXNEX_SWHDL_KMEMCACHE_INIT;
			ncleanup = MCXNEX_RSRC_CLEANUP_LEVEL28;
			break;

		default:
			continue;
		}

		/* Set the common values and call the init routine */
		rsrc_pool->rsrc_loc	 = MCXNEX_IN_SYSMEM;
		rsrc_pool->rsrc_state    = state;
		hdl_info.swi_rsrcpool    = rsrc_pool;
		hdl_info.swi_rsrcname    = rsrc_name;
		status = mcxnex_rsrc_sw_handles_init(state, &hdl_info);
		if (status != DDI_SUCCESS) {
			mcxnex_rsrc_fini(state, cleanup);
			status = DDI_FAILURE;
			goto rsrcinitp2_fail;
		}
		cleanup = ncleanup;

		/*
		 * For table entries, save away a pointer to the central list
		 * of handle pointers. These are used to enable fast lookup
		 * of the resources during event processing.
		 */
		switch (i) {
		case MCXNEX_CQHDL:
			state->hs_cqhdl = hdl_info.swi_table_ptr;
			break;
		case MCXNEX_QPHDL:
			state->hs_qphdl = hdl_info.swi_table_ptr;
			break;
		case MCXNEX_SRQHDL:
			state->hs_srqhdl = hdl_info.swi_table_ptr;
			break;
		case MCXNEX_MRHDL:
			break;
		default:
			break;
		}
	}

