Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_rsrc.c
	/*
	 * Initialize a resource pool for the MCG handles.  Notice that for
	 * these MCG handles, we are allocating a table of structures (used to
	 * keep track of the MCG entries that are being written to hardware
	 * and to speed up multicast attach/detach operations).
	 */
	hdl_info.swi_num	 = ((uint64_t)1 << cfgprof->cp_log_num_mcg);
	hdl_info.swi_max	 = ((uint64_t)1 << devlim->log_max_mcg);
	hdl_info.swi_flags	 = MCXNEX_SWHDL_TABLE_INIT;
	hdl_info.swi_prealloc_sz = sizeof (struct mcxnex_sw_mcg_list_s);
	status = mcxnex_rsrc_sw_handles_init(state, &hdl_info);
	if (status != DDI_SUCCESS) {
		mcxnex_rsrc_fini(state, cleanup);
		status = DDI_FAILURE;
		goto rsrcinitp2_fail;
	}
	state->hs_mcghdl = hdl_info.swi_table_ptr;
	cleanup = MCXNEX_RSRC_CLEANUP_LEVEL29;

	/*
	 * Last, initialize the resource pool for the UAR pages, which contain
	 * the hardware's doorbell registers. Each process supported in User
	 * Mode is assigned a UAR page. Also coming from this pool are the
	 * kernel-assigned UAR page, and any hardware-reserved pages. Note
	 * that the number of UAR pages is configurable, the value must be less
	 * than the maximum value (obtained from the QUERY_DEV_LIM command) or
	 * the initialization will fail.  Note also that we assign the base
	 * address of the UAR BAR to the rsrc_start parameter.
	 */
	num			  = ((uint64_t)1 << cfgprof->cp_log_num_uar);
	max			  = num;
	num_prealloc		  = max(devlim->num_rsvd_uar, 128);
	rsrc_pool		  = &state->hs_rsrc_hdl[MCXNEX_UARPG];
	rsrc_pool->rsrc_type	  = MCXNEX_UARPG;
	rsrc_pool->rsrc_loc	  = MCXNEX_IN_UAR;
	rsrc_pool->rsrc_pool_size = (num << PAGESHIFT);
	rsrc_pool->rsrc_shift	  = PAGESHIFT;
	rsrc_pool->rsrc_quantum	  = (uint_t)PAGESIZE;
	rsrc_pool->rsrc_align	  = PAGESIZE;
	rsrc_pool->rsrc_state	  = state;
	rsrc_pool->rsrc_start	  = (void *)state->hs_reg_uar_baseaddr;
	MCXNEX_RSRC_NAME(rsrc_name, MCXNEX_UAR_PAGE_VMEM_ATTCH);
	entry_info.hwi_num	  = num;
	entry_info.hwi_max	  = max;
	entry_info.hwi_prealloc	  = num_prealloc;
	entry_info.hwi_rsrcpool	  = rsrc_pool;
	entry_info.hwi_rsrcname	  = rsrc_name;
	status = mcxnex_rsrc_hw_entries_init(state, &entry_info);
	if (status != DDI_SUCCESS) {
		mcxnex_rsrc_fini(state, cleanup);
		status = DDI_FAILURE;
		goto rsrcinitp2_fail;
	}

	cleanup = MCXNEX_RSRC_CLEANUP_ALL;

	kmem_free(rsrc_name, MCXNEX_RSRC_NAME_MAXLEN);
	return (DDI_SUCCESS);

rsrcinitp2_fail:
	kmem_free(rsrc_name, MCXNEX_RSRC_NAME_MAXLEN);
	return (status);
}


/*
 * mcxnex_rsrc_fini()
 *    Context: Only called from attach() and/or detach() path contexts
 */
void
mcxnex_rsrc_fini(mcxnex_state_t *state, mcxnex_rsrc_cleanup_level_t clean)
{
	mcxnex_rsrc_sw_hdl_info_t	hdl_info;
	mcxnex_rsrc_hw_entry_info_t	entry_info;
	mcxnex_rsrc_mbox_info_t		mbox_info;
	mcxnex_cfg_profile_t		*cfgprof;

	ASSERT(state != NULL);

	cfgprof = state->hs_cfg_profile;

	/*
	 * If init code above is shortened up (see comments), then we
	 * need to establish how to safely and simply clean up from any
	 * given failure point. Flags, maybe...
	 */

	switch (clean) {
	/*
	 * If we add more resources that need to be cleaned up here, we should
	 * ensure that MCXNEX_RSRC_CLEANUP_ALL is still the first entry (i.e.
	 * corresponds to the last resource allocated).
	 */

	case MCXNEX_RSRC_CLEANUP_ALL:
	case MCXNEX_RSRC_CLEANUP_LEVEL31:
		/* Cleanup the UAR page resource pool, first the dbr pages */
		if (state->hs_kern_dbr) {
			mcxnex_dbr_kern_free(state);
			state->hs_kern_dbr = NULL;
		}

		/* NS then, the pool itself */
		entry_info.hwi_rsrcpool = &state->hs_rsrc_hdl[MCXNEX_UARPG];
		mcxnex_rsrc_hw_entries_fini(state, &entry_info);

		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL30:
		/* Cleanup the central MCG handle pointers list */
		hdl_info.swi_rsrcpool  = NULL;
		hdl_info.swi_table_ptr = state->hs_mcghdl;
		hdl_info.swi_num = ((uint64_t)1 << cfgprof->cp_log_num_mcg);
		hdl_info.swi_prealloc_sz = sizeof (struct mcxnex_sw_mcg_list_s);
		mcxnex_rsrc_sw_handles_fini(state, &hdl_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL29:
		/* Cleanup the reference count resource pool */
		hdl_info.swi_rsrcpool  = &state->hs_rsrc_hdl[MCXNEX_REFCNT];
		hdl_info.swi_table_ptr = NULL;
		mcxnex_rsrc_sw_handles_fini(state, &hdl_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL28:
		/* Cleanup the QP handle resource pool */
		hdl_info.swi_rsrcpool  = &state->hs_rsrc_hdl[MCXNEX_QPHDL];
		hdl_info.swi_table_ptr = state->hs_qphdl;
		hdl_info.swi_num = ((uint64_t)1 << cfgprof->cp_log_num_qp);
		hdl_info.swi_prealloc_sz = sizeof (mcxnex_qphdl_t);
		mcxnex_rsrc_sw_handles_fini(state, &hdl_info);
		/* FALLTHROUGH */
	case MCXNEX_RSRC_CLEANUP_LEVEL27:
		/* Cleanup the address handle resrouce pool */
		hdl_info.swi_rsrcpool  = &state->hs_rsrc_hdl[MCXNEX_AHHDL];
		hdl_info.swi_table_ptr = NULL;
		mcxnex_rsrc_sw_handles_fini(state, &hdl_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL26:
		/* Cleanup the SRQ handle resource pool. */
		hdl_info.swi_rsrcpool  = &state->hs_rsrc_hdl[MCXNEX_SRQHDL];
		hdl_info.swi_table_ptr = state->hs_srqhdl;
		hdl_info.swi_num = ((uint64_t)1 << cfgprof->cp_log_num_srq);
		hdl_info.swi_prealloc_sz = sizeof (mcxnex_srqhdl_t);
		mcxnex_rsrc_sw_handles_fini(state, &hdl_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL25:
		/* Cleanup the CQ handle resource pool */
		hdl_info.swi_rsrcpool  = &state->hs_rsrc_hdl[MCXNEX_CQHDL];
		hdl_info.swi_table_ptr = state->hs_cqhdl;
		hdl_info.swi_num = ((uint64_t)1 << cfgprof->cp_log_num_cq);
		hdl_info.swi_prealloc_sz = sizeof (mcxnex_cqhdl_t);
		mcxnex_rsrc_sw_handles_fini(state, &hdl_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL24:
		/* Cleanup the EQ handle resource pool */
		hdl_info.swi_rsrcpool  = &state->hs_rsrc_hdl[MCXNEX_EQHDL];
		hdl_info.swi_table_ptr = NULL;
		mcxnex_rsrc_sw_handles_fini(state, &hdl_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL23:
		/* Cleanup the MR handle resource pool */
		hdl_info.swi_rsrcpool  = &state->hs_rsrc_hdl[MCXNEX_MRHDL];
		hdl_info.swi_table_ptr = NULL;
		mcxnex_rsrc_sw_handles_fini(state, &hdl_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL22:
		/* Cleanup the PD handle resource pool */
		hdl_info.swi_rsrcpool  = &state->hs_rsrc_hdl[MCXNEX_PDHDL];
		hdl_info.swi_table_ptr = NULL;
		mcxnex_rsrc_pd_handles_fini(state, &hdl_info);
		/* FALLTHROUGH */

