Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_rsrc.c
	case MCXNEX_RSRC_CLEANUP_LEVEL21:
		/* Currently unused - FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL20:
		/* Cleanup the outstanding command list  */
		mcxnex_outstanding_cmdlist_fini(state);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL19:
		/* Cleanup the EQC table resource pool */
		entry_info.hwi_rsrcpool = &state->hs_rsrc_hdl[MCXNEX_EQC];
		mcxnex_rsrc_hw_entries_fini(state, &entry_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL18:
		/* Cleanup the MCG table resource pool */
		entry_info.hwi_rsrcpool = &state->hs_rsrc_hdl[MCXNEX_MCG];
		mcxnex_rsrc_hw_entries_fini(state, &entry_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL17:
		/* Currently Unused - fallthrough */
	case MCXNEX_RSRC_CLEANUP_LEVEL16:
		/* Cleanup the SRQC table resource pool */
		entry_info.hwi_rsrcpool = &state->hs_rsrc_hdl[MCXNEX_SRQC];
		mcxnex_rsrc_hw_entries_fini(state, &entry_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL15:
		/* Cleanup the AUXC table resource pool */
		entry_info.hwi_rsrcpool = &state->hs_rsrc_hdl[MCXNEX_AUXC];
		mcxnex_rsrc_hw_entries_fini(state, &entry_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL14:
		/* Cleanup the ALTCF table resource pool */
		entry_info.hwi_rsrcpool = &state->hs_rsrc_hdl[MCXNEX_ALTC];
		mcxnex_rsrc_hw_entries_fini(state, &entry_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL13:
		/* Cleanup the CQC table resource pool */
		entry_info.hwi_rsrcpool = &state->hs_rsrc_hdl[MCXNEX_CQC];
		mcxnex_rsrc_hw_entries_fini(state, &entry_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL12:
		/* Cleanup the RDB table resource pool */
		entry_info.hwi_rsrcpool = &state->hs_rsrc_hdl[MCXNEX_RDB];
		mcxnex_rsrc_hw_entries_fini(state, &entry_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL11:
		/* Cleanup the QPC table resource pool */
		entry_info.hwi_rsrcpool = &state->hs_rsrc_hdl[MCXNEX_QPC];
		mcxnex_rsrc_hw_entries_fini(state, &entry_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL10EQ:
		/* Cleanup the cMPTs for the EQs, CQs, SRQs, and QPs */
		entry_info.hwi_rsrcpool = &state->hs_rsrc_hdl[MCXNEX_CMPT_EQC];
		mcxnex_rsrc_hw_entries_fini(state, &entry_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL10CQ:
		/* Cleanup the cMPTs for the EQs, CQs, SRQs, and QPs */
		entry_info.hwi_rsrcpool = &state->hs_rsrc_hdl[MCXNEX_CMPT_CQC];
		mcxnex_rsrc_hw_entries_fini(state, &entry_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL10SRQ:
		/* Cleanup the cMPTs for the EQs, CQs, SRQs, and QPs */
		entry_info.hwi_rsrcpool = &state->hs_rsrc_hdl[MCXNEX_CMPT_SRQC];
		mcxnex_rsrc_hw_entries_fini(state, &entry_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL10QP:
		/* Cleanup the cMPTs for the EQs, CQs, SRQs, and QPs */
		entry_info.hwi_rsrcpool = &state->hs_rsrc_hdl[MCXNEX_CMPT_QPC];
		mcxnex_rsrc_hw_entries_fini(state, &entry_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL10:
		/* Cleanup the dMPT table resource pool */
		entry_info.hwi_rsrcpool = &state->hs_rsrc_hdl[MCXNEX_DMPT];
		mcxnex_rsrc_hw_entries_fini(state, &entry_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL9:
		/* Cleanup the MTT table resource pool */
		entry_info.hwi_rsrcpool = &state->hs_rsrc_hdl[MCXNEX_MTT];
		mcxnex_rsrc_hw_entries_fini(state, &entry_info);
		break;

	/*
	 * The cleanup below comes from the "Phase 1" initialization step.
	 * (see mcxnex_rsrc_init_phase1() above)
	 */
	case MCXNEX_RSRC_CLEANUP_PHASE1_COMPLETE:
		/* Cleanup the "In" mailbox list  */
		mcxnex_intr_inmbox_list_fini(state);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL7:
		/* Cleanup the interrupt "In" mailbox resource pool */
		mbox_info.mbi_rsrcpool =
		    &state->hs_rsrc_hdl[MCXNEX_INTR_IN_MBOX];
		mcxnex_rsrc_mbox_fini(state, &mbox_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL6:
		/* Cleanup the "In" mailbox list  */
		mcxnex_inmbox_list_fini(state);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL5:
		/* Cleanup the "In" mailbox resource pool */
		mbox_info.mbi_rsrcpool = &state->hs_rsrc_hdl[MCXNEX_IN_MBOX];
		mcxnex_rsrc_mbox_fini(state, &mbox_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL4:
		/* Cleanup the interrupt "Out" mailbox list  */
		mcxnex_intr_outmbox_list_fini(state);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL3:
		/* Cleanup the "Out" mailbox resource pool */
		mbox_info.mbi_rsrcpool =
		    &state->hs_rsrc_hdl[MCXNEX_INTR_OUT_MBOX];
		mcxnex_rsrc_mbox_fini(state, &mbox_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL2:
		/* Cleanup the "Out" mailbox list  */
		mcxnex_outmbox_list_fini(state);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL1:
		/* Cleanup the "Out" mailbox resource pool */
		mbox_info.mbi_rsrcpool = &state->hs_rsrc_hdl[MCXNEX_OUT_MBOX];
		mcxnex_rsrc_mbox_fini(state, &mbox_info);
		/* FALLTHROUGH */

	case MCXNEX_RSRC_CLEANUP_LEVEL0:
		/* Free the array of mcxnex_rsrc_pool_info_t's */

		kmem_free(state->hs_rsrc_hdl, MCXNEX_NUM_RESOURCES *
		    sizeof (mcxnex_rsrc_pool_info_t));

		kmem_cache_destroy(state->hs_rsrc_cache);
		break;

	default:
		MCXNEX_WARNING(state, "unexpected resource cleanup level");
		break;
	}
}


/*
 * mcxnex_rsrc_mbox_init()
 *    Context: Only called from attach() path context
 */
static int
mcxnex_rsrc_mbox_init(mcxnex_state_t *state, mcxnex_rsrc_mbox_info_t *info)
{
	mcxnex_rsrc_pool_info_t	*rsrc_pool;
	mcxnex_rsrc_priv_mbox_t	*priv;

	ASSERT(state != NULL);
	ASSERT(info != NULL);

	rsrc_pool = info->mbi_rsrcpool;
	ASSERT(rsrc_pool != NULL);

	/* Allocate and initialize mailbox private structure */
	priv = kmem_zalloc(sizeof (mcxnex_rsrc_priv_mbox_t), KM_SLEEP);
	priv->pmb_dip		= state->hs_dip;
	priv->pmb_devaccattr	= state->hs_reg_accattr;
	priv->pmb_xfer_mode	= DDI_DMA_CONSISTENT;

	/*
	 * Initialize many of the default DMA attributes.  Then set alignment
	 * and scatter-gather restrictions specific for mailbox memory.
	 */
	mcxnex_dma_attr_init(state, &priv->pmb_dmaattr);
	priv->pmb_dmaattr.dma_attr_align  = MCXNEX_MBOX_ALIGN;
	priv->pmb_dmaattr.dma_attr_sgllen = 1;
	priv->pmb_dmaattr.dma_attr_flags = 0;
	rsrc_pool->rsrc_private = priv;

