Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_rsrc.c
	ASSERT(rsrc_pool->rsrc_loc == MCXNEX_IN_SYSMEM);

	rsrc_pool->rsrc_start = NULL;
	rsrc_pool->rsrc_vmp = NULL;

	return (DDI_SUCCESS);
}


/*
 * mcxnex_rsrc_mbox_fini()
 *    Context: Only called from attach() and/or detach() path contexts
 */
/* ARGSUSED */
static void
mcxnex_rsrc_mbox_fini(mcxnex_state_t *state, mcxnex_rsrc_mbox_info_t *info)
{
	mcxnex_rsrc_pool_info_t	*rsrc_pool;

	ASSERT(state != NULL);
	ASSERT(info != NULL);

	rsrc_pool = info->mbi_rsrcpool;
	ASSERT(rsrc_pool != NULL);

	/* Free up the private struct */
	kmem_free(rsrc_pool->rsrc_private, sizeof (mcxnex_rsrc_priv_mbox_t));
}


/*
 * mcxnex_rsrc_hw_entries_init()
 *    Context: Only called from attach() path context
 */
int
mcxnex_rsrc_hw_entries_init(mcxnex_state_t *state,
    mcxnex_rsrc_hw_entry_info_t *info)
{
	mcxnex_rsrc_pool_info_t	*rsrc_pool;
	mcxnex_rsrc_t		*rsvd_rsrc = NULL;
	vmem_t			*vmp;
	uint64_t		num_hwentry, max_hwentry, num_prealloc;
	int			status;

	ASSERT(state != NULL);
	ASSERT(info != NULL);

	rsrc_pool	= info->hwi_rsrcpool;
	ASSERT(rsrc_pool != NULL);
	num_hwentry	= info->hwi_num;
	max_hwentry	= info->hwi_max;
	num_prealloc	= info->hwi_prealloc;

	/* Make sure number of HW entries makes sense */
	if (num_hwentry > max_hwentry) {
		cmn_err(CE_WARN, "Too many resource entries. "
		    "(num %llu, max %llu, type %u)",
		    (unsigned long long)num_hwentry,
		    (unsigned long long)max_hwentry, rsrc_pool->rsrc_type);
		return (DDI_FAILURE);
	}

	/* Set this pool's rsrc_start from the initial ICM allocation */
	if (rsrc_pool->rsrc_start == 0) {
		rsrc_pool->rsrc_start = (void *)(uintptr_t)
		    state->hs_icm[rsrc_pool->rsrc_type].icm_dma[0][0].vaddr;

	}

	/*
	 * Create new vmem arena for the HW entries table if rsrc_quantum
	 * is non-zero.  Otherwise if rsrc_quantum is zero, then these HW
	 * entries are not going to be dynamically allocatable (i.e. they
	 * won't be allocated/freed through mcxnex_rsrc_alloc/free).  This
	 * latter option is used for both ALTC and CMPT resources which
	 * are managed by hardware.
	 */
	if (rsrc_pool->rsrc_quantum != 0) {
		vmp = vmem_create(info->hwi_rsrcname,
		    (void *)(uintptr_t)rsrc_pool->rsrc_start,
		    rsrc_pool->rsrc_pool_size, rsrc_pool->rsrc_quantum,
		    NULL, NULL, NULL, 0, VM_SLEEP);
		if (vmp == NULL) {
			/* failed to create vmem arena */
			return (DDI_FAILURE);
		}
		rsrc_pool->rsrc_vmp = vmp;

	} else {
		/* we do not require a vmem arena */
		rsrc_pool->rsrc_vmp = NULL;
	}

	/* Allocate hardware reserved resources, if any */
	if (num_prealloc != 0) {
		status = mcxnex_rsrc_alloc(state, rsrc_pool->rsrc_type,
		    num_prealloc, DDI_SLEEP, &rsvd_rsrc);
		if (status != DDI_SUCCESS) {
			/* unable to preallocate the reserved entries */
			if (rsrc_pool->rsrc_vmp != NULL) {
				vmem_destroy(rsrc_pool->rsrc_vmp);
			}
			return (DDI_FAILURE);
		}
	}
	rsrc_pool->rsrc_private = rsvd_rsrc;

	DTRACE_PROBE2(mcxnex__rsrc_hw_entries_init,
	    mcxnex_state_t *, state,
	    mcxnex_rsrc_pool_info_t *, rsrc_pool);

	return (DDI_SUCCESS);
}


/*
 * mcxnex_rsrc_hw_entries_fini()
 *    Context: Only called from attach() and/or detach() path contexts
 */
void
mcxnex_rsrc_hw_entries_fini(mcxnex_state_t *state,
    mcxnex_rsrc_hw_entry_info_t *info)
{
	mcxnex_rsrc_pool_info_t	*rsrc_pool;
	mcxnex_rsrc_t		*rsvd_rsrc;

	ASSERT(state != NULL);
	ASSERT(info != NULL);

	rsrc_pool = info->hwi_rsrcpool;
	ASSERT(rsrc_pool != NULL);

	/* Free up any "reserved" (i.e. preallocated) HW entries */
	rsvd_rsrc = (mcxnex_rsrc_t *)rsrc_pool->rsrc_private;
	if (rsvd_rsrc != NULL) {
		mcxnex_rsrc_free(state, &rsvd_rsrc);
	}

	/*
	 * If we've actually setup a vmem arena for the HW entries, then
	 * destroy it now
	 */
	if (rsrc_pool->rsrc_vmp != NULL) {
		vmem_destroy(rsrc_pool->rsrc_vmp);
	}
}


/*
 * mcxnex_rsrc_sw_handles_init()
 *    Context: Only called from attach() path context
 */
/* ARGSUSED */
static int
mcxnex_rsrc_sw_handles_init(mcxnex_state_t *state,
    mcxnex_rsrc_sw_hdl_info_t *info)
{
	mcxnex_rsrc_pool_info_t	*rsrc_pool;
	uint64_t		num_swhdl, max_swhdl, prealloc_sz;

	ASSERT(state != NULL);
	ASSERT(info != NULL);

	rsrc_pool	= info->swi_rsrcpool;
	ASSERT(rsrc_pool != NULL);
	num_swhdl	= info->swi_num;
	max_swhdl	= info->swi_max;
	prealloc_sz	= info->swi_prealloc_sz;


	/* Make sure number of SW handles makes sense */
	if (num_swhdl > max_swhdl) {
		return (DDI_FAILURE);
	}

	/*
	 * Depending on the flags parameter, create a kmem_cache for some
	 * number of software handle structures.  Note: kmem_cache_create()
	 * will SLEEP until successful.
	 */
	if (info->swi_flags & MCXNEX_SWHDL_KMEMCACHE_INIT) {
		rsrc_pool->rsrc_private = kmem_cache_create(
		    info->swi_rsrcname, rsrc_pool->rsrc_quantum, 0,
		    info->swi_constructor, info->swi_destructor, NULL,
		    rsrc_pool->rsrc_state, NULL, 0);
	}


	/* Allocate the central list of SW handle pointers */
	if (info->swi_flags & MCXNEX_SWHDL_TABLE_INIT) {
		info->swi_table_ptr = kmem_zalloc(num_swhdl * prealloc_sz,
		    KM_SLEEP);
	}

	return (DDI_SUCCESS);
}


/*
 * mcxnex_rsrc_sw_handles_fini()
 *    Context: Only called from attach() and/or detach() path contexts
 */
/* ARGSUSED */
static void
mcxnex_rsrc_sw_handles_fini(mcxnex_state_t *state,
    mcxnex_rsrc_sw_hdl_info_t *info)
{
	mcxnex_rsrc_pool_info_t	*rsrc_pool;
	uint64_t		num_swhdl, prealloc_sz;

	ASSERT(state != NULL);
	ASSERT(info != NULL);

	rsrc_pool	= info->swi_rsrcpool;
	num_swhdl	= info->swi_num;
	prealloc_sz	= info->swi_prealloc_sz;

	/*
	 * If a "software handle" kmem_cache exists for this resource, then
	 * destroy it now
	 */
	if (rsrc_pool != NULL) {
		kmem_cache_destroy(rsrc_pool->rsrc_private);
	}

	/* Free up this central list of SW handle pointers */
	if (info->swi_table_ptr != NULL) {
		kmem_free(info->swi_table_ptr, num_swhdl * prealloc_sz);
	}
}


/*
 * mcxnex_rsrc_pd_handles_init()
 *    Context: Only called from attach() path context
 */
static int
mcxnex_rsrc_pd_handles_init(mcxnex_state_t *state,
    mcxnex_rsrc_sw_hdl_info_t *info)
{
	mcxnex_rsrc_pool_info_t	*rsrc_pool;
	vmem_t			*vmp;
	char			vmem_name[MCXNEX_RSRC_NAME_MAXLEN];
	int			status;

	ASSERT(state != NULL);
	ASSERT(info != NULL);

	rsrc_pool = info->swi_rsrcpool;
	ASSERT(rsrc_pool != NULL);

	/* Initialize the resource pool for software handle table */
	status = mcxnex_rsrc_sw_handles_init(state, info);
	if (status != DDI_SUCCESS) {
		return (DDI_FAILURE);
	}

	/* Build vmem arena name from Mcxnex instance */
	MCXNEX_RSRC_NAME(vmem_name, MCXNEX_PDHDL_VMEM);

	/* Create new vmem arena for PD numbers */
	vmp = vmem_create(vmem_name, (caddr_t)1, info->swi_num, 1, NULL,
	    NULL, NULL, 0, VM_SLEEP | VMC_IDENTIFIER);
	if (vmp == NULL) {
		/* Unable to create vmem arena */
		info->swi_table_ptr = NULL;
		mcxnex_rsrc_sw_handles_fini(state, info);
		return (DDI_FAILURE);
	}
	rsrc_pool->rsrc_vmp = vmp;

	return (DDI_SUCCESS);
}


