Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_rsrc.c
/*
 * mcxnex_rsrc_pd_handles_fini()
 *    Context: Only called from attach() and/or detach() path contexts
 */
static void
mcxnex_rsrc_pd_handles_fini(mcxnex_state_t *state,
    mcxnex_rsrc_sw_hdl_info_t *info)
{
	mcxnex_rsrc_pool_info_t	*rsrc_pool;

	ASSERT(state != NULL);
	ASSERT(info != NULL);

	rsrc_pool = info->swi_rsrcpool;

	/* Destroy the specially created UAR scratch table vmem arena */
	vmem_destroy(rsrc_pool->rsrc_vmp);

	/* Destroy the "mcxnex_sw_pd_t" kmem_cache */
	mcxnex_rsrc_sw_handles_fini(state, info);
}


/*
 * mcxnex_rsrc_mbox_alloc()
 *    Context: Only called from attach() path context
 */
static int
mcxnex_rsrc_mbox_alloc(mcxnex_rsrc_pool_info_t *pool_info, uint_t num,
    mcxnex_rsrc_t *hdl)
{
	mcxnex_rsrc_priv_mbox_t	*priv;
	caddr_t			kaddr;
	size_t			real_len, temp_len;
	int			status;

	ASSERT(pool_info != NULL);
	ASSERT(hdl != NULL);

	/* Get the private pointer for the mailboxes */
	priv = pool_info->rsrc_private;
	ASSERT(priv != NULL);

	/* Allocate a DMA handle for the mailbox */
	status = ddi_dma_alloc_handle(priv->pmb_dip, &priv->pmb_dmaattr,
	    DDI_DMA_SLEEP, NULL, &hdl->hr_dmahdl);
	if (status != DDI_SUCCESS) {
		return (DDI_FAILURE);
	}

	/* Allocate memory for the mailbox */
	temp_len = (num * pool_info->rsrc_quantum);
	status = ddi_dma_mem_alloc(hdl->hr_dmahdl, temp_len,
	    &priv->pmb_devaccattr, priv->pmb_xfer_mode, DDI_DMA_SLEEP,
	    NULL, &kaddr, &real_len, &hdl->hr_acchdl);
	if (status != DDI_SUCCESS) {
		/* No more memory available for mailbox entries */
		ddi_dma_free_handle(&hdl->hr_dmahdl);
		return (DDI_FAILURE);
	}

	hdl->hr_addr = (void *)kaddr;
	hdl->hr_len  = (uint32_t)real_len;

	return (DDI_SUCCESS);
}


/*
 * mcxnex_rsrc_mbox_free()
 *    Context: Can be called from interrupt or base context.
 */
static void
mcxnex_rsrc_mbox_free(mcxnex_rsrc_pool_info_t *pool_info, mcxnex_rsrc_t *hdl)
{
	ASSERT(pool_info != NULL);
	ASSERT(hdl != NULL);

	/* Use ddi_dma_mem_free() to free up sys memory for mailbox */
	ddi_dma_mem_free(&hdl->hr_acchdl);

	/* Free the DMA handle for the mailbox */
	ddi_dma_free_handle(&hdl->hr_dmahdl);
}


/*
 * mcxnex_rsrc_hw_entry_alloc()
 *    Context: Can be called from interrupt or base context.
 */
static int
mcxnex_rsrc_hw_entry_alloc(mcxnex_rsrc_pool_info_t *pool_info, uint_t num,
    uint_t num_align, ddi_acc_handle_t acc_handle, uint_t sleepflag,
    mcxnex_rsrc_t *hdl)
{
	void			*addr;
	uint64_t		offset;
	uint32_t		align;
	int			status;
	int			flag;

	ASSERT(pool_info != NULL);
	ASSERT(hdl != NULL);

	/*
	 * Mcxnex hardware entries (QPC, CQC, EQC, MPT, etc.) do not
	 * generally use the acc_handle (because the entries are not
	 * directly accessed by software).  The exception to this rule
	 * are the MTT entries.
	 */

	/*
	 * Use vmem_xalloc() to get a properly aligned pointer (based on
	 * the number requested) to the HW entry(ies).  This handles the
	 * cases (for special QPCs and for RDB entries) where we need more
	 * than one and need to ensure that they are properly aligned.
	 */
	flag = (sleepflag == DDI_SLEEP) ? VM_SLEEP : VM_NOSLEEP;
	hdl->hr_len = (num * pool_info->rsrc_quantum);
	align = (num_align * pool_info->rsrc_quantum);

	addr = vmem_xalloc(pool_info->rsrc_vmp, hdl->hr_len,
	    align, 0, 0, NULL, NULL, flag | VM_FIRSTFIT);

	if (addr == NULL) {
		/* No more HW entries available */
		return (DDI_FAILURE);
	}

	hdl->hr_acchdl = acc_handle;

	/* Calculate vaddr and HW table index */
	offset = (uintptr_t)addr - (uintptr_t)pool_info->rsrc_start;
	hdl->hr_addr = addr;
	hdl->hr_indx = offset >> pool_info->rsrc_shift;

	if (pool_info->rsrc_loc == MCXNEX_IN_ICM) {
		/* confirm ICM is mapped, and allocate if necessary */
		status = mcxnex_rsrc_hw_entry_icm_confirm(pool_info, num, hdl);
		if (status != DDI_SUCCESS) {
			return (DDI_FAILURE);
		}
	}

	return (DDI_SUCCESS);
}



/*
 * mcxnex_rsrc_hw_entry_free()
 *    Context: Can be called from interrupt or base context.
 */
static void
mcxnex_rsrc_hw_entry_free(mcxnex_rsrc_pool_info_t *pool_info,
    mcxnex_rsrc_t *hdl)
{
	void			*addr;
	uint64_t		offset;
	int			status;

	ASSERT(pool_info != NULL);
	ASSERT(hdl != NULL);

	/* Calculate the allocated address */
	offset = hdl->hr_indx << pool_info->rsrc_shift;
	addr = (void *)(uintptr_t)(offset + (uintptr_t)pool_info->rsrc_start);

	/* Use vmem_xfree() to free up the HW table entry */
	vmem_xfree(pool_info->rsrc_vmp, addr, hdl->hr_len);

	if (pool_info->rsrc_loc == MCXNEX_IN_ICM) {
		/* free ICM references, and free ICM if required */
		status = mcxnex_rsrc_hw_entry_icm_free(pool_info, hdl);
		if (status != DDI_SUCCESS)
			MCXNEX_WARNING(pool_info->rsrc_state,
			    "failure in hw_entry_free");
	}
}

/*
 * mcxnex_rsrc_hw_entry_icm_confirm()
 *    Context: Can be called from interrupt or base context.
 */
static int
mcxnex_rsrc_hw_entry_icm_confirm(mcxnex_rsrc_pool_info_t *pool_info, uint_t num,
    mcxnex_rsrc_t *hdl)
{
	mcxnex_state_t		*state;
	mcxnex_icm_table_t	*icm_table;
	uint8_t			*bitmap;
	mcxnex_dma_info_t	*dma_info;
	mcxnex_rsrc_type_t	type;
	uint32_t		rindx, span_offset;
	uint32_t		span_avail;
	int			num_backed;
	int			status;
	uint32_t		index1, index2;

	/*
	 * Utility routine responsible for ensuring that there is memory
	 * backing the ICM resources allocated via mcxnex_rsrc_hw_entry_alloc().
	 * Confirm existing ICM mapping(s) or allocate ICM memory for the
	 * given hardware resources being allocated, and increment the
	 * ICM DMA structure(s) reference count.
	 *
	 * We may be allocating more objects than can fit in a single span,
	 * or more than will fit in the remaining contiguous memory (from
	 * the offset indicated by hdl->ar_indx) in the span in question.
	 * In either of these cases, we'll be breaking up our allocation
	 * into multiple spans.
	 */
	state = pool_info->rsrc_state;
	type  = pool_info->rsrc_type;
	icm_table = &state->hs_icm[type];

	rindx = hdl->hr_indx;
	mcxnex_index(index1, index2, rindx, icm_table, span_offset);

	mutex_enter(&icm_table->icm_table_lock);
	mcxnex_bitmap(bitmap, dma_info, icm_table, index1);
	while (num) {
#ifndef __lock_lint
		while (icm_table->icm_busy) {
			cv_wait(&icm_table->icm_table_cv,
			    &icm_table->icm_table_lock);
		}
#endif
		if (!MCXNEX_BMAP_BIT_ISSET(bitmap, index2)) {
			/* Allocate ICM for this span */
			icm_table->icm_busy = 1;
			mutex_exit(&icm_table->icm_table_lock);
			status = mcxnex_icm_alloc(state, type, index1, index2);
			mutex_enter(&icm_table->icm_table_lock);
			icm_table->icm_busy = 0;
			cv_broadcast(&icm_table->icm_table_cv);
			if (status != DDI_SUCCESS) {
				goto fail_alloc;
			}
		}

