Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_rsrc.c
		/*
		 * Mellanox FMR accesses the MPT directly.  We set the
		 * access handle here only for this case
		 */
		if (type == MCXNEX_DMPT)
			hdl->hr_acchdl = dma_info[index2].acc_hdl;

		/*
		 * We need to increment the refcnt of this span by the
		 * number of objects in this resource allocation that are
		 * backed by this span. Given that the rsrc allocation is
		 * contiguous, this value will be the number of objects in
		 * the span from 'span_offset' onward, either up to a max
		 * of the total number of objects, or the end of the span.
		 * So, determine the number of objects that can be backed
		 * by this span ('span_avail'), then determine the number
		 * of backed resources.
		 */
		span_avail = icm_table->span - span_offset;
		if (num > span_avail) {
			num_backed = span_avail;
		} else {
			num_backed = num;
		}

		/*
		 * Now that we know 'num_backed', increment the refcnt,
		 * decrement the total number, and set 'span_offset' to
		 * 0 in case we roll over into the next span.
		 */
		dma_info[index2].icm_refcnt += num_backed;
		rindx += num_backed;
		num -= num_backed;

		if (num == 0)
			break;

		mcxnex_index(index1, index2, rindx, icm_table, span_offset);
		mcxnex_bitmap(bitmap, dma_info, icm_table, index1);
	}
	mutex_exit(&icm_table->icm_table_lock);

	return (DDI_SUCCESS);

fail_alloc:
	/* JBDB */

#if needs_work
	/* free refcnt's and any spans we've allocated */
	while (index-- != start) {
		/*
		 * JBDB - This is a bit tricky.  We need to
		 * free refcnt's on any spans that we've
		 * incremented them on, and completely free
		 * spans that we've allocated. How do we do
		 * this here? Does it need to be as involved
		 * as the core of icm_free() below, or can
		 * we leverage breadcrumbs somehow?
		 */
		MCXNEX_WARNING(state, "unable to allocate ICM memory: "
		    "UNIMPLEMENTED HANDLING!!");
	}
#else
	cmn_err(CE_WARN,
	    "unimplemented fail code in mcxnex_rsrc_hw_entry_icm_alloc");
#endif
	mutex_exit(&icm_table->icm_table_lock);

	MCXNEX_WARNING(state, "unable to allocate ICM memory");
	return (DDI_FAILURE);
}

/*
 * mcxnex_rsrc_hw_entry_icm_free()
 *    Context: Can be called from interrupt or base context.
 */
static int
mcxnex_rsrc_hw_entry_icm_free(mcxnex_rsrc_pool_info_t *pool_info,
    mcxnex_rsrc_t *hdl)
{
	mcxnex_state_t		*state;
	mcxnex_icm_table_t	*icm_table;
	uint8_t			*bitmap;
	mcxnex_dma_info_t	*dma_info;
	mcxnex_rsrc_type_t	type;
	uint32_t		span_offset;
	uint32_t		span_remain;
	int			num_freed;
	int			num;
	uint32_t		index1, index2, rindx;

	/*
	 * Utility routine responsible for freeing references to ICM
	 * DMA spans, and freeing the ICM memory if necessary.
	 *
	 * We may have allocated objects in a single contiguous resource
	 * allocation that reside in a number of spans, at any given
	 * starting offset within a span. We therefore must determine
	 * where this allocation starts, and then determine if we need
	 * to free objects in more than one span.
	 */
	state = pool_info->rsrc_state;
	type  = pool_info->rsrc_type;
	icm_table = &state->hs_icm[type];

	rindx = hdl->hr_indx;
	mcxnex_index(index1, index2, rindx, icm_table, span_offset);
	mcxnex_bitmap(bitmap, dma_info, icm_table, index1);

	/* determine the number of ICM objects in this allocation */
	num = hdl->hr_len >> pool_info->rsrc_shift;

	mutex_enter(&icm_table->icm_table_lock);
	while (num) {
		/*
		 * As with the ICM confirm code above, we need to
		 * decrement the ICM span(s) by the number of
		 * resources being freed. So, determine the number
		 * of objects that are backed in this span from
		 * 'span_offset' onward, and set 'num_freed' to
		 * the smaller of either that number ('span_remain'),
		 * or the total number of objects being freed.
		 */
		span_remain = icm_table->span - span_offset;
		if (num > span_remain) {
			num_freed = span_remain;
		} else {
			num_freed = num;
		}

		/*
		 * Now that we know 'num_freed', decrement the refcnt,
		 * decrement the total number, and set 'span_offset' to
		 * 0 in case we roll over into the next span.
		 */
		dma_info[index2].icm_refcnt -= num_freed;
		num -= num_freed;
		rindx += num_freed;

#if MCXNEX_ICM_FREE_ENABLED
		/* If we've freed the last object in this span, free it */
		if ((index1 != 0 || index2 != 0) &&
		    (dma_info[index2].icm_refcnt == 0)) {
			mcxnex_icm_free(state, type, index1, index2);
		}
#endif
		if (num == 0)
			break;

		mcxnex_index(index1, index2, rindx, icm_table, span_offset);
		mcxnex_bitmap(bitmap, dma_info, icm_table, index1);
	}
	mutex_exit(&icm_table->icm_table_lock);

	return (DDI_SUCCESS);
}



/*
 * mcxnex_rsrc_swhdl_alloc()
 *    Context: Can be called from interrupt or base context.
 */
static int
mcxnex_rsrc_swhdl_alloc(mcxnex_rsrc_pool_info_t *pool_info, uint_t sleepflag,
    mcxnex_rsrc_t *hdl)
{
	void	*addr;
	int	flag;

	ASSERT(pool_info != NULL);
	ASSERT(hdl != NULL);

	/* Allocate the software handle structure */
	flag = (sleepflag == DDI_SLEEP) ? KM_SLEEP : KM_NOSLEEP;
	addr = kmem_cache_alloc(pool_info->rsrc_private, flag);
	if (addr == NULL) {
		return (DDI_FAILURE);
	}
	hdl->hr_len  = pool_info->rsrc_quantum;
	hdl->hr_addr = addr;

	return (DDI_SUCCESS);
}


/*
 * mcxnex_rsrc_swhdl_free()
 *    Context: Can be called from interrupt or base context.
 */
static void
mcxnex_rsrc_swhdl_free(mcxnex_rsrc_pool_info_t *pool_info, mcxnex_rsrc_t *hdl)
{
	ASSERT(pool_info != NULL);
	ASSERT(hdl != NULL);

	/* Free the software handle structure */
	kmem_cache_free(pool_info->rsrc_private, hdl->hr_addr);
}


/*
 * mcxnex_rsrc_pdhdl_alloc()
 *    Context: Can be called from interrupt or base context.
 */
static int
mcxnex_rsrc_pdhdl_alloc(mcxnex_rsrc_pool_info_t *pool_info, uint_t sleepflag,
    mcxnex_rsrc_t *hdl)
{
	mcxnex_pdhdl_t	addr;
	void		*tmpaddr;
	int		flag, status;

	ASSERT(pool_info != NULL);
	ASSERT(hdl != NULL);

	/* Allocate the software handle */
	status = mcxnex_rsrc_swhdl_alloc(pool_info, sleepflag, hdl);
	if (status != DDI_SUCCESS) {
		return (DDI_FAILURE);
	}
	addr = (mcxnex_pdhdl_t)hdl->hr_addr;
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*addr))

	/* Allocate a PD number for the handle */
	flag = (sleepflag == DDI_SLEEP) ? VM_SLEEP : VM_NOSLEEP;
	tmpaddr = vmem_alloc(pool_info->rsrc_vmp, 1, flag);
	if (tmpaddr == NULL) {
		/* No more PD number entries available */
		mcxnex_rsrc_swhdl_free(pool_info, hdl);
		return (DDI_FAILURE);
	}
	addr->pd_pdnum = (uint32_t)(uintptr_t)tmpaddr;
	addr->pd_rsrcp = hdl;
	hdl->hr_indx   = addr->pd_pdnum;

	return (DDI_SUCCESS);
}


