Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_rsrc.c
/*
 * mcxnex_rsrc_pdhdl_free()
 *    Context: Can be called from interrupt or base context.
 */
static void
mcxnex_rsrc_pdhdl_free(mcxnex_rsrc_pool_info_t *pool_info, mcxnex_rsrc_t *hdl)
{
	ASSERT(pool_info != NULL);
	ASSERT(hdl != NULL);

	/* Use vmem_free() to free up the PD number */
	vmem_free(pool_info->rsrc_vmp, (void *)(uintptr_t)hdl->hr_indx, 1);

	/* Free the software handle structure */
	mcxnex_rsrc_swhdl_free(pool_info, hdl);
}


/*
 * mcxnex_rsrc_pdhdl_constructor()
 *    Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
static int
mcxnex_rsrc_pdhdl_constructor(void *pd, void *priv, int flags)
{
	mcxnex_pdhdl_t	pdhdl;
	mcxnex_state_t	*state;

	pdhdl = (mcxnex_pdhdl_t)pd;
	state = (mcxnex_state_t *)priv;

	mutex_init(&pdhdl->pd_lock, NULL, MUTEX_DRIVER,
	    DDI_INTR_PRI(state->hs_intrmsi_pri));

	return (DDI_SUCCESS);
}


/*
 * mcxnex_rsrc_pdhdl_destructor()
 *    Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
static void
mcxnex_rsrc_pdhdl_destructor(void *pd, void *priv)
{
	mcxnex_pdhdl_t	pdhdl;

	pdhdl = (mcxnex_pdhdl_t)pd;

	mutex_destroy(&pdhdl->pd_lock);
}


/*
 * mcxnex_rsrc_cqhdl_constructor()
 *    Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
static int
mcxnex_rsrc_cqhdl_constructor(void *cq, void *priv, int flags)
{
	mcxnex_cqhdl_t	cqhdl;
	mcxnex_state_t	*state;

	cqhdl = (mcxnex_cqhdl_t)cq;
	state = (mcxnex_state_t *)priv;

	mutex_init(&cqhdl->cq_lock, NULL, MUTEX_DRIVER,
	    DDI_INTR_PRI(state->hs_intrmsi_pri));

	return (DDI_SUCCESS);
}


/*
 * mcxnex_rsrc_cqhdl_destructor()
 *    Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
static void
mcxnex_rsrc_cqhdl_destructor(void *cq, void *priv)
{
	mcxnex_cqhdl_t	cqhdl;

	cqhdl = (mcxnex_cqhdl_t)cq;

	mutex_destroy(&cqhdl->cq_lock);
}


/*
 * mcxnex_rsrc_qphdl_constructor()
 *    Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
static int
mcxnex_rsrc_qphdl_constructor(void *qp, void *priv, int flags)
{
	mcxnex_qphdl_t	qphdl;
	mcxnex_state_t	*state;

	qphdl = (mcxnex_qphdl_t)qp;
	state = (mcxnex_state_t *)priv;

	mutex_init(&qphdl->qp_lock, NULL, MUTEX_DRIVER,
	    DDI_INTR_PRI(state->hs_intrmsi_pri));

	return (DDI_SUCCESS);
}


/*
 * mcxnex_rsrc_qphdl_destructor()
 *    Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
static void
mcxnex_rsrc_qphdl_destructor(void *qp, void *priv)
{
	mcxnex_qphdl_t	qphdl;

	qphdl = (mcxnex_qphdl_t)qp;

	mutex_destroy(&qphdl->qp_lock);
}


/*
 * mcxnex_rsrc_srqhdl_constructor()
 *    Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
static int
mcxnex_rsrc_srqhdl_constructor(void *srq, void *priv, int flags)
{
	mcxnex_srqhdl_t	srqhdl;
	mcxnex_state_t	*state;

	srqhdl = (mcxnex_srqhdl_t)srq;
	state = (mcxnex_state_t *)priv;

	mutex_init(&srqhdl->srq_lock, NULL, MUTEX_DRIVER,
	    DDI_INTR_PRI(state->hs_intrmsi_pri));

	return (DDI_SUCCESS);
}


/*
 * mcxnex_rsrc_srqhdl_destructor()
 *    Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
static void
mcxnex_rsrc_srqhdl_destructor(void *srq, void *priv)
{
	mcxnex_srqhdl_t	srqhdl;

	srqhdl = (mcxnex_srqhdl_t)srq;

	mutex_destroy(&srqhdl->srq_lock);
}


/*
 * mcxnex_rsrc_refcnt_constructor()
 *    Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
static int
mcxnex_rsrc_refcnt_constructor(void *rc, void *priv, int flags)
{
	mcxnex_sw_refcnt_t	*refcnt;
	mcxnex_state_t		*state;

	refcnt = (mcxnex_sw_refcnt_t *)rc;
	state  = (mcxnex_state_t *)priv;

	mutex_init(&refcnt->swrc_lock, NULL, MUTEX_DRIVER,
	    DDI_INTR_PRI(state->hs_intrmsi_pri));

	return (DDI_SUCCESS);
}


/*
 * mcxnex_rsrc_refcnt_destructor()
 *    Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
static void
mcxnex_rsrc_refcnt_destructor(void *rc, void *priv)
{
	mcxnex_sw_refcnt_t	*refcnt;

	refcnt = (mcxnex_sw_refcnt_t *)rc;

	mutex_destroy(&refcnt->swrc_lock);
}


/*
 * mcxnex_rsrc_ahhdl_constructor()
 *    Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
static int
mcxnex_rsrc_ahhdl_constructor(void *ah, void *priv, int flags)
{
	mcxnex_ahhdl_t	ahhdl;
	mcxnex_state_t	*state;

	ahhdl = (mcxnex_ahhdl_t)ah;
	state = (mcxnex_state_t *)priv;

	mutex_init(&ahhdl->ah_lock, NULL, MUTEX_DRIVER,
	    DDI_INTR_PRI(state->hs_intrmsi_pri));
	return (DDI_SUCCESS);
}


/*
 * mcxnex_rsrc_ahhdl_destructor()
 *    Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
static void
mcxnex_rsrc_ahhdl_destructor(void *ah, void *priv)
{
	mcxnex_ahhdl_t	ahhdl;

	ahhdl = (mcxnex_ahhdl_t)ah;

	mutex_destroy(&ahhdl->ah_lock);
}


/*
 * mcxnex_rsrc_mrhdl_constructor()
 *    Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
static int
mcxnex_rsrc_mrhdl_constructor(void *mr, void *priv, int flags)
{
	mcxnex_mrhdl_t	mrhdl;
	mcxnex_state_t	*state;

	mrhdl = (mcxnex_mrhdl_t)mr;
	state = (mcxnex_state_t *)priv;

	mutex_init(&mrhdl->mr_lock, NULL, MUTEX_DRIVER,
	    DDI_INTR_PRI(state->hs_intrmsi_pri));

	return (DDI_SUCCESS);
}


/*
 * mcxnex_rsrc_mrhdl_destructor()
 *    Context: Can be called from interrupt or base context.
 */
/* ARGSUSED */
static void
mcxnex_rsrc_mrhdl_destructor(void *mr, void *priv)
{
	mcxnex_mrhdl_t	mrhdl;

	mrhdl = (mcxnex_mrhdl_t)mr;

	mutex_destroy(&mrhdl->mr_lock);
}


/*
 * mcxnex_rsrc_mcg_entry_get_size()
 */
static int
mcxnex_rsrc_mcg_entry_get_size(mcxnex_state_t *state, uint_t *mcg_size_shift)
{
	uint_t	num_qp_per_mcg, max_qp_per_mcg, log2;

	/*
	 * Round the configured number of QP per MCG to next larger
	 * power-of-2 size and update.
	 */
	num_qp_per_mcg = state->hs_cfg_profile->cp_num_qp_per_mcg + 8;
	log2 = highbit(num_qp_per_mcg);
	if ((num_qp_per_mcg & (num_qp_per_mcg - 1)) == 0) {
		log2 = log2 - 1;
	}
	state->hs_cfg_profile->cp_num_qp_per_mcg = (1 << log2) - 8;

	/* Now make sure number of QP per MCG makes sense */
	num_qp_per_mcg = state->hs_cfg_profile->cp_num_qp_per_mcg;
	max_qp_per_mcg = (1 << state->hs_devlim.log_max_qp_mcg);
	if (num_qp_per_mcg > max_qp_per_mcg) {
		return (DDI_FAILURE);
	}

	/* Return the (shift) size of an individual MCG HW entry */
	*mcg_size_shift = log2 + 2;

	return (DDI_SUCCESS);
}
